## [DataFrame 연산-3]
- 일대일 대응으로 인덱스가 동일한 원소들 끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행이 가능함.

In [15]:
import pandas as pd
import numpy as np

In [16]:
# 데이터 준비
data={'A':[98,78, np.nan,52],
      'B':[96,58,10,42]}

In [17]:
# Dict 데이터 --> DataFrame 형태로 저장
df1=pd.DataFrame(data)
df1

      A   B
0  98.0  96
1  78.0  58
2   NaN  10
3  52.0  42

In [18]:
# 연산수행 DataFrame + 숫자
df1.add(5, fill_value=0)

       A    B
0  103.0  101
1   83.0   63
2    5.0   15
3   57.0   47

In [19]:
# DataFrame + DataFrame
df1.add(df1+10, axis=1)

       A    B
0  206.0  202
1  166.0  126
2    NaN   30
3  114.0   94

In [20]:
data={'A':[98,78, 20,52],
      'B':[96,58,10,42]}
df2=pd.DataFrame(data)
df2

    A   B
0  98  96
1  78  58
2  20  10
3  52  42

In [21]:
df1.add(df2, fill_value=0)

       A    B
0  196.0  192
1  156.0  116
2   20.0   20
3  104.0   84